Revit 2024 API
MechanicalSystem.IsPressureDropServerMissing Method
 Indicates if any pressure drop server which was used in the mechanical system is not available.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsPressureDropServerMissing()
Visual Basic
Public Function IsPressureDropServerMissing As Boolean
Visual C++
public:
bool IsPressureDropServerMissing()
Return Value
 True if there is any pressure drop server not available, false otherwise.
See Also
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace